car/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;        //k is the Turbulent Kinetic Energy
			  // for each new case. k=(3/2)*((U/I)^2)  U=Freestream fluid velocity
				    // I is Turbulence Intensity and can be estimated 
				    // I=0.16*Re       Re=Pipe Diameter Reynolds #
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0503;            //// was 0.00325

boundaryField
{
    visc_main
    {
        type            kqRWallFunction;        // think this is correct
        value           uniform 0.0503;		//check this value
    }
    visc_refine_1
    {
        type            kqRWallFunction;        // think this is correct
        value           uniform 0.0503;		//check this value
    }
     visc_refine_2
    {
        type            kqRWallFunction; 	// think this is correct
        value           uniform 0.0503;		//check this value
    }
    inlet
    {
        type            fixedValue; 		// think this is correct
	value           uniform 0.0503;		//check this value
    }
    outlet
    {
        type            zeroGradient;		// think this is correct
    }
}


// ************************************************************************* //
