car/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p; //Units are Pascals divided by the density
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0; 

boundaryField
{
    visc_main
    {
        type            zeroGradient;
    }

    visc_refine_1
    {
        type            zeroGradient;
    }

    visc_refine_2
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 206; //pascals divided by the density (equiv 2 bar)
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
}

// ************************************************************************* //
